#Подвиг 1. Напишите программу ввода строки и отображения на экране ее первого и последнего символа в виде одной строки.
#Sample Input:
#I love Python
#Sample Output:
#In



# put your python code here
a = str(input())
print(a[0] + a[-1])