#Подвиг 5. Напишите программу отображения последних трех символов из введенной строки. Будем полагать, что строка гарантированно длиной не менее трех символов.
#Sample Input:
#Balakirev
#Sample Output:
#rev



# put your python code here
a = str(input())
print(a[-3:])