#Подвиг 6. Напишите программу отображения всех символов с нечетными индексами из введенной строки.
#Sample Input:
#Balakirev
#Sample Output:
#aaie


# put your python code here
a = str(input())
print(a[1::2])