#Подвиг 4. На вход программе подается целое число: порядковый номер дня недели (1, 2, ..., 7). Необходимо прочитать это число и вывести на экран название дня недели:
#понедельник, вторник, среда, четверг, пятница, суббота, воскресенье
#Программу реализовать с использованием операторов if-elif.
#Sample Input:
#2
#Sample Output:
#вторник


# put your python code here
a = int(input())
if a == 1 :
    print("понедельник")
if a == 2 :
    print("вторник")
if a == 3 :
    print("среда")
if a == 4 :
    print("четверг")
if a == 5 :
    print("пятница")
if a == 6 :
    print("суббота")    
if a == 7 :
    print("воскресенье") 